MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/Arhiv/FlyRf_Base_26_04_21_20/WebRF.cpp
/*
  Модуль WebRF.cpp
  Назначение:
  - WEB-интерфейс настройки и обслуживания устройства.

  Основные задачи модуля:
  - Поднимать HTTP-сервер и формировать HTML-страницы конфигуратора.
  - Показывать текущие параметры работы устройства и служебную диагностику.
  - Принимать изменения настроек, применять их в runtime и сохранять в EEPROM.
  - Выполнять сервисные действия: перезагрузка, обновление, изменение режимов и параметров вывода.
*/

#include "WebRF.h"
#include <WebServer.h>
#include <Update.h>
#include <math.h>
#include <TimeLib.h>
#include "WiFiRF.h"
#include "EEPROMRF.h"
#include "RP2040Bridge.h"
#include "TrafficDB.h"
#include "Log.h"
#include "NMEA.h"
#include "DeviceInfo.h"
#include "RF.h"
#include "ESP32RF.h"
#include "GNSS.h"
#include "Baro.h"
#include "Bluetooth.h"


String TxDataTemplate;
static WebServer server(80);
static bool g_rebootPending = false;
static uint32_t g_rebootAtMs = 0;
static bool g_updateOk = false;
static String g_updateMessage;
static bool g_otaInProgress = false;
static uint32_t g_otaWritten = 0;
static uint32_t g_otaTotal = 0;

static void scheduleReboot(uint32_t delayMs = 1500)
{
    g_rebootPending = true;
    g_rebootAtMs = millis() + delayMs;
}

static void sendNoCache()
{
    server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    server.sendHeader("Pragma", "no-cache");
    server.sendHeader("Expires", "-1");
}

static int clampInt(int v, int lo, int hi)
{
    if (v < lo) return lo;
    if (v > hi) return hi;
    return v;
}

static const char* sel(bool cond) { return cond ? "selected" : ""; }
static const char* chk(bool cond) { return cond ? "checked" : ""; }


static int clampAlarmAttention(int v) { return clampInt(v, 2000, 3000); }
static int clampAlarmWarning(int v)   { return clampInt(v,  200, 2000); }
static int clampAlarmDanger(int v)    { return clampInt(v,   10,  500); }
static int clampAlarmHeight(int v)    { return clampInt(v,   30,  300); }

static String ipToString(const uint8_t ip[4])
{
    if (ip == nullptr) return String("0.0.0.0");
    return String(ip[0]) + "." + String(ip[1]) + "." + String(ip[2]) + "." + String(ip[3]);
}

static String ipToString(const IPAddress& ip)
{
    return String(ip[0]) + "." + String(ip[1]) + "." + String(ip[2]) + "." + String(ip[3]);
}

static String formatUtcNowText()
{
    if (!GNSS_timeValid()) return String("&#1085;&#1077;&#1090;");

    const time_t t = now();
    char buf[32];
    snprintf(buf, sizeof(buf), "%02d.%02d.%04d %02d:%02d:%02d",
             day(t), month(t), year(t), hour(t), minute(t), second(t));
    return String(buf);
}

static String formatGnssCoordinateText()
{
    if (!GNSS_coordinatesValid()) return String("&#1085;&#1077;&#1090;");
    return String(GNSS_latitude(), 5) + ", " + String(GNSS_longitude(), 5);
}

static String formatAltitudeText()
{
    char buf[48];
    if (Baro_available())
    {
        snprintf(buf, sizeof(buf), "%.1f m (BMP180)", Baro_altitudeMeters());
        return String(buf);
    }
    if (GNSS_altitudeValid())
    {
        snprintf(buf, sizeof(buf), "%.1f m (GNSS)", GNSS_altitudeMeters());
        return String(buf);
    }
    return String("&#1085;&#1077;&#1090;");
}

static String formatGpsAltitudeText()
{
    char buf[32];
    if (GNSS_altitudeValid())
    {
        snprintf(buf, sizeof(buf), "%.1f m", GNSS_altitudeMeters());
        return String(buf);
    }
    return String("&#1085;&#1077;&#1090;");
}


static void applyRuntimeLocalCoordinates()
{
    if (!settings) return;

    settings->input_coordinates = FlyRfMode_usesLocalCoordinates(settings->mode) ? IMPUT_COORD_MANUAL : IMPUT_COORD_GNSS;
    GNSS_applyCurrentStateToThisAircraft();
}

static const char* sourceName(TrafficSource source)
{
    switch (source)
    {
        case TRAFFIC_SOURCE_FLARM_LORA:    return "FLARM";
        case TRAFFIC_SOURCE_ADSB_DUMP1090: return "ADS-B";
        case TRAFFIC_SOURCE_UNKNOWN:
        default:                           return "?";
    }
}

static const char* trackerSendName(uint8_t v)
{
    switch (v)
    {
        case 1: return "Single";
        case 2: return "Auto";
        case 3: return "Mini";
        default: return "Off";
    }
}

static const char* workModeName(uint8_t mode)
{
    switch (mode)
    {
        case FLYRF_MODE_TXRX_TEST1: return "&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;";
        case FLYRF_MODE_TXRX_TEST2: return "&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077;&#1090;&#1077;";
        case FLYRF_MODE_TXRX_TEST3: return "&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; + 5 &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;";
        case FLYRF_MODE_TXRX_TEST4: return "&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; + 5 &#1085;&#1077; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;";
        case FLYRF_MODE_NORMAL:
        default: return "&#1053;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084;";
    }
}


static const char* nmeaName(uint8_t mode)
{
    switch (mode)
    {
        case NMEA_OUTPUT_SERIAL: return "Serial";
        case NMEA_OUTPUT_UDP: return "UDP";
        case NMEA_OUTPUT_BLUETOOTH: return "Bluetooth";
        default: return "Off";
    }
}

static const char* rfProtocolName(uint8_t protocol)
{
    switch (protocol)
    {
        case RF_PROTOCOL_MAVLINK: return "MAVLink";
        case RF_PROTOCOL_OGNTP:
        default: return "OGNTP";
    }
}

static uint8_t parseRfProtocolArg(const String& value)
{
    const int parsed = value.toInt();
    return (parsed == (int)RF_PROTOCOL_MAVLINK) ? RF_PROTOCOL_MAVLINK : RF_PROTOCOL_OGNTP;
}

static const char* serialModeName(uint8_t mode)
{
    switch (mode)
    {
        case OUTPUT_MODE_CONTAINER: return "Container";
        case OUTPUT_MODE_NMEA: return "NMEA";
        case OUTPUT_MODE_RP2040: return "RP2040 RX";
        case OUTPUT_MODE_FLARM: return "FLARM RX";
        case OUTPUT_MODE_LORA_RAW: return "LoRa RAW RX";
        case OUTPUT_MODE_MAVLINK: return "MAVLink";
        default: return "&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;";
    }
}

static const char* rs485ModeName(uint8_t mode)
{
    switch (mode)
    {
        case OUTPUT_MODE_CONTAINER: return "Container";
        case OUTPUT_MODE_NMEA: return "NMEA";
        case OUTPUT_MODE_RS485_DISPLAY: return "&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081;";
        case OUTPUT_MODE_FLARM: return "FLARM RX";
        case OUTPUT_MODE_MAVLINK: return "MAVLink";
        default: return "&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;";
    }
}

static const char* bluetoothModeName(uint8_t mode)
{
    switch (mode)
    {
        case BLUETOOTH_LE: return "LE";
        default: return "Off";
    }
}

static const char* onOffName(uint8_t v)
{
    return v ? "&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;" : "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;";
}

static const char* yesNo(uint8_t v, const char* noTxt = "&#1053;&#1077;&#1090;", const char* yesTxt = "&#1044;&#1072;")
{
    return v ? yesTxt : noTxt;
}

static const char* tftMemoryViewName(uint8_t v)
{
    return yesNo(v, "&#1042;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;", "&#1042;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;");
}

static const char* displayModeName(uint8_t mode)
{
    switch (mode)
    {
        case INFO_DISPLAY_COORDINATE: return "&#1057; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080;";
        case INFO_DISPLAY_MAXI:       return "&#1055;&#1086;&#1083;&#1085;&#1072;&#1103; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;";
        case INFO_DISPLAY_LORA_RAW:   return "LoRa RAW RX";
        case INFO_DISTLAY_OFF:
        default:                      return "&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;";
    }
}

static const char* loraFixedModeName(uint8_t mode)
{
    return mode ? "Fixed" : "Auto (freqplan)";
}

static const char* loraFixedFreqName(uint8_t idx)
{
    static const char* const kNames[] = {
        "868.0 MHz", "868.1 MHz", "868.2 MHz", "868.3 MHz", "868.4 MHz",
        "868.5 MHz", "868.6 MHz", "868.7 MHz", "868.8 MHz", "868.9 MHz"
    };
    if (idx >= (sizeof(kNames) / sizeof(kNames[0]))) idx = 0;
    return kNames[idx];
}

static const char* radarRangeModeName(uint8_t mode)
{
    return mode ? "&#1060;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;" : "&#1040;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081;";
}

static String loraRuntimeModeText()
{
    RF_LoraRuntimeInfo info = {};
    if (!RF_GetLoraRuntimeInfo(info) || !info.valid)
    {
        return String("недоступно");
    }

    const char* runtimeProfile = "OGN compatible / custom";
    if (info.bandwidthKHz == 125 && info.spreadingFactor == 9 && info.codingRateDenom == 6)
    {
        runtimeProfile = "Long range";
    }
    else if (info.bandwidthKHz == 125 && info.spreadingFactor == 12 && info.codingRateDenom == 8)
    {
        runtimeProfile = "Max range";
    }
    else if (info.bandwidthKHz == 125 && info.spreadingFactor == 8 && info.codingRateDenom == 6)
    {
        runtimeProfile = "Fast robust";
    }

    char syncBuf[16];
    snprintf(syncBuf, sizeof(syncBuf), "%02X", (unsigned)info.syncWord);

    String html;
    html.reserve(900);
    html += F("<table style='width:100%;border-collapse:collapse;table-layout:fixed;'>");
    html += String("<tr><th class='left' style='width:54%;padding:2px 8px 2px 0;'>Профиль</th><td style='padding:2px 0;text-align:right;'>") + runtimeProfile + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>Частота</th><td style='padding:2px 0;text-align:right;'>") + String((double)info.frequencyHz / 1000000.0, 3) + String(" MHz</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>SF</th><td style='padding:2px 0;text-align:right;'>") + String(info.spreadingFactor) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>BW</th><td style='padding:2px 0;text-align:right;'>") + String(info.bandwidthKHz) + String(" kHz</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>CR</th><td style='padding:2px 0;text-align:right;'>4/") + String(info.codingRateDenom) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>SyncWord</th><td style='padding:2px 0;text-align:right;'>0x") + String(syncBuf) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>RX symbols</th><td style='padding:2px 0;text-align:right;'>") + String(info.rxSymbols) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>TX power</th><td style='padding:2px 0;text-align:right;'>") + String(info.txPowerDbm) + String(" dBm</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>LowDataRateOptimize</th><td style='padding:2px 0;text-align:right;'>") + (info.lowDataRateOptimize ? String("On") : String("Off")) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>CRC payload</th><td style='padding:2px 0;text-align:right;'>") + (info.crcOnPayload ? String("On") : String("Off")) + String("</td></tr>");
    html += String("<tr><th class='left' style='padding:2px 8px 2px 0;'>Header mode</th><td style='padding:2px 0;text-align:right;'>") + (info.implicitHeader ? String("Implicit") : String("Explicit")) + String("</td></tr>");
    html += F("</table>");
    return html;
}

static String loraRuntimeSourceText()
{
    return RF_GetLoraRegistersSourceText();
}

static String loraRuntimeSettingsBlock(const char* titleHtml, bool centeredTitle = false)
{
    String html;
    html.reserve(1400);
    html += F("<div class='settingsBlock'><div class='blockTitle");
    if (centeredTitle) html += F(" blockTitleCenter");
    html += F("'>");
    html += (titleHtml ? String(titleHtml) : String("LoRa / LMIC"));
    html += F("</div>");
    html += loraRuntimeModeText();
    html += F("<table><tr><th>Источник данных LMIC / LoRa</th><td>");
    html += loraRuntimeSourceText();
    html += F("</td></tr></table></div>");
    return html;
}

static void parseIpArg(const String& name, uint8_t out[4])
{
    if (!server.hasArg(name) || out == nullptr) return;

    int a = 0, b = 0, c = 0, d = 0;
    if (sscanf(server.arg(name).c_str(), "%d.%d.%d.%d", &a, &b, &c, &d) == 4)
    {
        out[0] = (uint8_t)clampInt(a, 0, 255);
        out[1] = (uint8_t)clampInt(b, 0, 255);
        out[2] = (uint8_t)clampInt(c, 0, 255);
        out[3] = (uint8_t)clampInt(d, 0, 255);
    }
}


