MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/Arhiv/FlyRf_Base_26_04_21_20/WebRF.cpp
    for (size_t i = 0; i < normalized.length(); ++i)
    {
        const char c = normalized.charAt(i);
        const bool digit = (c >= '0' && c <= '9');
        const bool latinHex = (c >= 'A' && c <= 'F');
        if (!digit && !latinHex)
        {
            return false;
        }
    }

    return true;
}

static uint32_t parseBlockAddrArg(const String& value)
{
    String normalized;
    if (!normalizeBlockAddrText(value, normalized))
    {
        return 0U;
    }

    if (normalized.length() == 0)
    {
        return 0U;
    }

    const unsigned long parsed = strtoul(normalized.c_str(), nullptr, 16);
    if (parsed > 0xFFFFFFUL)
    {
        return 0U;
    }
    return (uint32_t)parsed;
}

static bool readBlockAddrArg(const char* argName, uint32_t& outValue, String& normalized, String& errorText)
{
    normalized = String();
    errorText = String();
    outValue = 0U;

    if (!server.hasArg(argName))
    {
        return true;
    }

    const String raw = server.arg(argName);
    if (!normalizeBlockAddrText(raw, normalized))
    {
        errorText = F("&#1053;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1074;&#1074;&#1086;&#1076; &#1072;&#1076;&#1088;&#1077;&#1089;&#1072; &#1074; &#1087;&#1086;&#1083;&#1077; ");
        errorText += argName;
        errorText += F(". &#1042;&#1074;&#1077;&#1076;&#1080;&#1090;&#1077; 6 HEX-&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;: 0-9 &#1080; A-F.");
        return false;
    }

    outValue = parseBlockAddrArg(normalized);
    return true;
}

static String blockAddrInputFilterScript(const char* inputName)
{
    String s;
    s.reserve(320);
    s += F("<script>(function(){var el=document.querySelector('input[name=\"");
    s += inputName;
    s += F("\"]');if(!el)return;function norm(forceZero){var v=(el.value||'').toUpperCase().replace(/[^0-9A-F]/g,'').slice(0,6);if(forceZero&&v.length===0)v='000000';if(el.value!==v)el.value=v;}el.addEventListener('input',function(){norm(false);});el.addEventListener('blur',function(){norm(true);});norm(true);})();</script>");
    return s;
}

static void formatBlockAddr(char* out, size_t outSize, uint32_t value)
{
    if (out == nullptr || outSize == 0)
    {
        return;
    }

    snprintf(out, outSize, "%06lX", (unsigned long)(value & 0xFFFFFFUL));
}

static void formatBlockAddrSummary(char* out, size_t outSize, uint32_t value)
{
    if (out == nullptr || outSize == 0)
    {
        return;
    }

    snprintf(out, outSize, "%06lX", (unsigned long)(value & 0xFFFFFFUL));
}

static String blockAddrSummary()
{
    char addr1[16];
    char addr2[16];
    char addr3[16];
    formatBlockAddrSummary(addr1, sizeof(addr1), settings ? settings->block_addr[0] : 0U);
    formatBlockAddrSummary(addr2, sizeof(addr2), settings ? settings->block_addr[1] : 0U);
    formatBlockAddrSummary(addr3, sizeof(addr3), settings ? settings->block_addr[2] : 0U);

    String s;
    s.reserve(64);
    s += addr1;
    s += F(", ");
    s += addr2;
    s += F(", ");
    s += addr3;
    return s;
}

static String rootPage()
{
    String html = htmlBegin("FlyRf Base");
    html += F("<h1>FlyRf Base</h1><table>");
    html += F("<tr><th>&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</th><td>");
    html += DeviceInfo_chipIdHex();
    html += F("</td></tr>");
    html += F("<tr><th>&#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1072;&#1076;&#1088;&#1077;&#1089;</th><td>");
    html += blockAddrSummary();
    html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1077;&#1088;&#1089;&#1080;&#1103; &#1055;&#1054;</th><td>");
    html += DeviceInfo_programVersion();
    html += F("</td></tr>");
    html += F("<tr><th>Radio</th><td>SX127x</td></tr>");
    uint32_t txPackets = 0;
    uint32_t rxPackets = 0;
    RF_GetPacketCounters(txPackets, rxPackets);
    html += F("<tr><th>LoRa &#1087;&#1072;&#1082;&#1077;&#1090;&#1086;&#1074;</th><td id='pktCounters'>Tx&nbsp; ");
    html += String(txPackets);
    html += F("&nbsp;&nbsp;&nbsp; Rx&nbsp; ");
    html += String(rxPackets);
    html += F("</td></tr>");
    html += F("<tr><th>&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; latitude</th><td>");
    html += String(settings ? settings->local_latitude : 55.95501f, 5);
    html += F("</td></tr>");
    html += F("<tr><th>&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; longitude</th><td>");
    html += String(settings ? settings->local_longitude : 37.23166f, 5);
    html += F("</td></tr>");
    html += F("<tr><th>WiFi AP SSID</th><td>");
    html += String(WiFi_ssid());
    html += F("</td></tr>");
    html += F("<tr><th>WiFi AP IP</th><td>");
    html += WiFi_apIP().toString();
    html += F("</td></tr>");
    html += F("<tr><th>WiFi MAC</th><td>");
    html += WiFi_macAddressStr();
    html += F("</td></tr>");
    html += F("<tr><th>NMEA output</th><td>");
    html += nmeaName(settings ? settings->nmea_out : NMEA_OUTPUT_OFF);
    if (settings && settings->nmea_out == NMEA_OUTPUT_UDP)
    {
        html += F(" / port ");
        html += String(settings->udp_port ? settings->udp_port : WiFi_defaultNmeaUdpPort());
    }
    html += F("</td></tr>");
    html += F("<tr><th>Bluetooth</th><td>");
    html += bluetoothModeName(settings ? settings->bluetooth : BLUETOOTH_OFF);
    if (settings && settings->bluetooth == BLUETOOTH_LE)
    {
        html += F(" / ");
        html += Bluetooth_name();
    }
    html += F("</td></tr>");
    html += F("</table><div class='hr'></div>");
    html += F("<div class='settingsBlock'><div class='blockTitle blockTitleCenter'>&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; GNSS</div><table>");
    html += F("<tr><th>&#1042;&#1088;&#1077;&#1084;&#1103; UTC</th><td id='gnssTimeUtc'>");
    html += formatUtcNowText();
    html += F("</td></tr>");
    html += F("<tr><th>GPS &#1089;&#1087;&#1091;&#1090;&#1085;&#1080;&#1082;&#1080;</th><td id='gnssSats'>");
    html += String(GNSS_satellitesValid() ? GNSS_satellites() : 0);
    html += F("</td></tr>");
    html += F("<tr><th>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1105;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099;</th><td id='gnssCoords'>");
    html += formatGnssCoordinateText();
    html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072; GPS</th><td id='gnssGpsAlt'>");
    html += formatGpsAltitudeText();
    html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072; &#1085;&#1072;&#1076; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077;&#1084; &#1084;&#1086;&#1088;&#1103;</th><td id='gnssAlt'>");
    html += formatAltitudeText();
    html += F("</td></tr></table></div>");
    html += loraRuntimeSettingsBlock("&#1056;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; LoRa / LMIC", true);
    html += F("<div class='btnRow' style='flex-direction:column;align-items:center;'>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/settings'><span class='btnIcon'>&#9881;</span>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/hardware_settings'><span class='btnIcon'>&#129520;</span>&#1040;&#1087;&#1087;&#1072;&#1088;&#1072;&#1090;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</a>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/outputs'><span class='btnIcon'>&#128228;</span>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084;</a>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/about'><span class='btnIcon'>&#8505;</span>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</a>");
    html += F("<a class='btn frontBtn' data-startbtn='1' href='/firmware'><span class='btnIcon'>&#11014;</span>&#1054;&#1073;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</a>");
    html += F("</div><div class='hr'></div>");
    html += F(R"JS(<script>
(function(){
  var el=document.getElementById('pktCounters');
  if(!el) return;
  var gnssTime=document.getElementById('gnssTimeUtc');
  var gnssSats=document.getElementById('gnssSats');
  var gnssCoords=document.getElementById('gnssCoords');
  var gnssGpsAlt=document.getElementById('gnssGpsAlt');
  var gnssAlt=document.getElementById('gnssAlt');
  var busy=false;
  function applyActiveButtons(){
    var items=document.querySelectorAll('[data-startbtn="1"]');
    if(!items || !items.length) return;
    var active='';
    try{ active=localStorage.getItem('flyrf_start_active') || ''; }catch(e){}
    for(var i=0;i<items.length;i++){
      var href=items[i].getAttribute('href') || '';
      if(active && href===active) items[i].classList.add('active');
      else items[i].classList.remove('active');
      items[i].addEventListener('click', function(){
        try{ localStorage.setItem('flyrf_start_active', this.getAttribute('href') || ''); }catch(e){}
      });
    }
  }
  applyActiveButtons();

  function updateCounters(){
    if(busy) return;
    busy=true;
    fetch('/packet_counters',{cache:'no-store'})
      .then(function(r){ return r.ok ? r.json() : Promise.reject(); })
      .then(function(data){
        if(!data) return;
        el.innerHTML='Tx&nbsp; '+(data.tx||0)+'&nbsp;&nbsp;&nbsp; Rx&nbsp; '+(data.rx||0);
        if(gnssTime && data.utc_text!==undefined) gnssTime.innerHTML=String(data.utc_text);
        if(gnssSats && data.satellites!==undefined) gnssSats.textContent=String(data.satellites);
        if(gnssCoords && data.coords_text!==undefined) gnssCoords.innerHTML=String(data.coords_text);
        if(gnssGpsAlt && data.gps_altitude_text!==undefined) gnssGpsAlt.innerHTML=String(data.gps_altitude_text);
        if(gnssAlt && data.altitude_text!==undefined) gnssAlt.innerHTML=String(data.altitude_text);
      })
      .catch(function(){} )
      .finally(function(){ busy=false; });
  }
  updateCounters();
  setInterval(updateCounters,1000);
})();
</script>)JS");
    html += F("</div></body></html>");
    return html;
}

static String settingsPage()
{
    String html = htmlBegin("&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;");
    html += F("<h1>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;</h1><form id='settings_form' action='/input' method='GET'>");
    html += F("<div class='settingsBlock'><div class='blockTitle'>&#1051;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1080; &#1088;&#1077;&#1078;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</div><table>");
    html += F("<tr><th>&#1056;&#1077;&#1078;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</th><td><select class='wLong settingsTopCtl50 compactSelect' style='width:210px;min-width:210px;max-width:210px;' name='mode'>");
    html += String("<option ") + sel((settings ? settings->mode : FLYRF_MODE_NORMAL) == FLYRF_MODE_NORMAL) + " value='0'>&#1053;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084;</option>";
    html += String("<option ") + sel((settings ? settings->mode : FLYRF_MODE_NORMAL) == FLYRF_MODE_TXRX_TEST1) + " value='1'>&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; &#1079;&#1072;&#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;</option>";
    html += String("<option ") + sel((settings ? settings->mode : FLYRF_MODE_NORMAL) == FLYRF_MODE_TXRX_TEST2) + " value='2'>&#1057;&#1072;&#1084;&#1086;&#1083;&#1077;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077;&#1090;&#1077;</option>";
    html += String("<option ") + sel((settings ? settings->mode : FLYRF_MODE_NORMAL) == FLYRF_MODE_TXRX_TEST3) + " value='3'> + 5 &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;</option>";
    html += String("<option ") + sel((settings ? settings->mode : FLYRF_MODE_NORMAL) == FLYRF_MODE_TXRX_TEST4) + " value='4'> + 5 &#1085;&#1077; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1055;&#1086;&#1083;&#1091;&#1096;&#1072;&#1088;&#1080;&#1077; (&#1089;&#1077;&#1074;&#1077;&#1088;/&#1102;&#1075;)</th><td><select class='wShort settingsTopCtl50 compactSelect' style='width:100px;min-width:100px;max-width:100px; name='input_N_S'>");
    html += String("<option ") + sel(settings && settings->input_N_S == 0) + " value='0'>N</option>";
    html += String("<option ") + sel(settings && settings->input_N_S != 0) + " value='1'>S</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>latitude (&#1096;&#1080;&#1088;&#1086;&#1090;&#1072; 0&#176; - 90&#176;)</th><td><input class='settingsTopCtl30 compactSelect' style='width:120px;min-width:120px;max-width:120px; type='text' name='local_latitude' value='");
    html += String(settings ? settings->local_latitude : 55.95501f, 5);
    html += F("'></td></tr>");
    html += F("<tr><th>&#1044;&#1086;&#1083;&#1075;&#1086;&#1090;&#1072; (&#1074;&#1086;&#1089;&#1090;&#1086;&#1082;/&#1079;&#1072;&#1087;&#1072;&#1076;)</th><td><select class='wShort settingsTopCtl50 compactSelect' style='width:100px;min-width:100px;max-width:100px; name='input_E_W'>");
    html += String("<option ") + sel(settings && settings->input_E_W == 0) + " value='0'>E</option>";
    html += String("<option ") + sel(settings && settings->input_E_W != 0) + " value='1'>W</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>longitude (0&#176; - 180&#176;)</th><td><input class='settingsTopCtl30 compactSelect' style='width:120px;min-width:120px;max-width:120px; type='text' name='local_longitude' value='");
    html += String(settings ? settings->local_longitude : 37.23166f, 5);
    html += F("'></td></tr>");
    html += F("</table></div><div class='btnRowEqual'><button class='btn' type='submit'><span class='btnIcon'>&#128190;</span>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</button><a class='btn' href='/'><span class='btnIcon'>&#8634;</span>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;</a></div></form>");
    html += F("</div></body></html>");

    return html;
}

static String settingsSavedPage()
{
    String html = htmlBegin("&#1053;&#1086;&#1074;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;");
    html += F("<h1>&#1053;&#1086;&#1074;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;:</h1><table>");
    html += F("<tr><th>TRACKER send</th><td>"); html += trackerSendName(settings ? settings->tracker_send : 0); html += F("</td></tr>");
    html += F("<tr><th>&#1056;&#1077;&#1078;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099;</th><td>"); html += workModeName(settings ? settings->mode : DEVICE_MODE_NORMAL); html += F("</td></tr>");
    html += F("<tr><th>&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</th><td>"); html += ((settings && FlyRfMode_usesLocalCoordinates(settings->mode)) ? "WEB/local" : "GPS/GNSS"); html += F("</td></tr>");
    html += F("<tr><th>&#1055;&#1086;&#1083;&#1091;&#1096;&#1072;&#1088;&#1080;&#1077;</th><td>"); html += (settings && settings->input_N_S ? "S" : "N"); html += F("</td></tr>");
    html += F("<tr><th>Latitude</th><td>"); html += String(settings ? settings->local_latitude : 55.95501f, 5); html += F("</td></tr>");
    html += F("<tr><th>&#1044;&#1086;&#1083;&#1075;&#1086;&#1090;&#1072;</th><td>"); html += (settings && settings->input_E_W ? "W" : "E"); html += F("</td></tr>");
    html += F("<tr><th>Longitude</th><td>"); html += String(settings ? settings->local_longitude : 37.23166f, 5); html += F("</td></tr>");
    html += F("<tr><th>WiFi AP IP</th><td>"); html += WiFi_apIP().toString(); html += F("</td></tr>");
    html += F("</table>");
    html += loraRuntimeSettingsBlock("&#1056;&#1077;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; LoRa / LMIC");
    html += F("<div class='hr'></div><div class='confirmTitle'>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;.</div><div class='btnRow'><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1053;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;</a></div></div></body></html>");
    return html;
}

