MoseychukA/FLARM_ALL/ChatGPT_FlyRF/ESP32_Base/Arhiv/FlyRf_Base_26_04_21_20/WebRF.cpp
static String outputsPage()
{
    String html = htmlBegin("&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084;");
    html += F("<h1>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084;</h1><form id='outputs_form' action='/outputs_save' method='GET'><table>");
    html += F("<tr><th>NMEA output</th><td><select class='wLong hardwareCtl30 compactSelect' style='width:210px;min-width:210px;max-width:210px;' name='nmea_out'>");
    html += String("<option ") + sel((settings ? settings->nmea_out : NMEA_OUTPUT_OFF) == NMEA_OUTPUT_OFF) + " value='0'>Off</option>";
    html += String("<option ") + sel((settings ? settings->nmea_out : NMEA_OUTPUT_OFF) == NMEA_OUTPUT_SERIAL) + " value='1'>Serial</option>";
    html += String("<option ") + sel((settings ? settings->nmea_out : NMEA_OUTPUT_OFF) == NMEA_OUTPUT_UDP) + " value='2'>UDP</option>";
    html += String("<option ") + sel((settings ? settings->nmea_out : NMEA_OUTPUT_OFF) == NMEA_OUTPUT_BLUETOOTH) + " value='3'>Bluetooth</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>UDP port</th><td><input class='wLong hardwareCtl30 compactSelect' style='width:210px;min-width:210px;max-width:210px;' type='number' min='1' max='65535' name='udp_port' value='");
    html += String(settings && settings->udp_port ? settings->udp_port : WiFi_defaultNmeaUdpPort());
    html += F("'></td></tr>");
    html += F("<tr><th>Bluetooth</th><td><select class='wLong hardwareCtl30 compactSelect' style='width:210px;min-width:210px;max-width:210px;' name='bluetooth'>");
    html += String("<option ") + sel((settings ? settings->bluetooth : BLUETOOTH_OFF) == BLUETOOTH_OFF) + " value='0'>Off</option>";
    html += String("<option ") + sel((settings ? settings->bluetooth : BLUETOOTH_OFF) == BLUETOOTH_LE) + " value='1'>LE</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; Serial</th><td><select class='wLong hardwareCtl30 compactSelect' style='width:210px;min-width:210px;max-width:210px;' name='serial_out'>");
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_OFF) + " value='0'>&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_CONTAINER) + " value='1'>Container</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_RP2040) + " value='3'>RP2040 RX</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_FLARM) + " value='4'>FLARM RX</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_LORA_RAW) + " value='5'>LoRa RAW RX</option>";
    html += String("<option ") + sel((settings ? settings->serial_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_MAVLINK) + " value='6'>MAVLink</option>";
    html += F("</select></td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; RS485</th><td><select class='wLong hardwareCtl30 compactSelect' style='width:210px;min-width:210px;max-width:210px;' name='rs485_out'>");
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_OFF) + " value='0'>&#1053;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_CONTAINER) + " value='1'>Container</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_NMEA) + " value='2'>NMEA</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_RS485_DISPLAY) + " value='3'>&#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1076;&#1080;&#1089;&#1087;&#1083;&#1077;&#1081;</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_FLARM) + " value='4'>FLARM RX</option>";
    html += String("<option ") + sel((settings ? settings->rs485_out : OUTPUT_MODE_OFF) == OUTPUT_MODE_MAVLINK) + " value='6'>MAVLink</option>";
    html += F("</select></td></tr></table><div class='btnRowEqual'><button class='btn' type='submit'><span class='btnIcon'>&#128190;</span>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080; &#1086;&#1073;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;</button><a class='btn' href='/'><span class='btnIcon'>&#8634;</span>&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103;</a></div></form>");
    html += F("</div></body></html>");

    return html;
}

static String outputsSavedPage()
{
    String html = htmlBegin("&#1053;&#1086;&#1074;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;");
    html += F("<h1>&#1053;&#1086;&#1074;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;:</h1><table>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; Serial</th><td>"); html += serialModeName(settings ? settings->serial_out : OUTPUT_MODE_OFF); html += F("</td></tr>");
    html += F("<tr><th>&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; RS485</th><td>"); html += rs485ModeName(settings ? settings->rs485_out : OUTPUT_MODE_OFF); html += F("</td></tr>");
    html += F("<tr><th>NMEA output</th><td>"); html += nmeaName(settings ? settings->nmea_out : NMEA_OUTPUT_OFF); if (settings && settings->nmea_out == NMEA_OUTPUT_UDP) { html += F(" / port "); html += String(settings->udp_port ? settings->udp_port : WiFi_defaultNmeaUdpPort()); } html += F("</td></tr>");
    html += F("<tr><th>Bluetooth</th><td>"); html += bluetoothModeName(settings ? settings->bluetooth : BLUETOOTH_OFF); if (settings && settings->bluetooth == BLUETOOTH_LE) { html += F(" / "); html += Bluetooth_name(); } html += F("</td></tr>");
    html += F("</table><div class='hr'></div><div class='confirmTitle'>&#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1099; &#1073;&#1077;&#1079; &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080;.</div><div class='btnRow'><a class='btn' href='/'><span class='btnIcon'>&#127968;</span>&#1053;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1091;&#1102;</a></div></div></body></html>");
    return html;
}

static String aboutPage()
{
    String html = htmlBegin("&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;");
    html += F("<h1>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103;</h1>");
    html += F("<div class='about'>== &#1069;&#1090;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; FlyRF ==<br>");
    html += F("== &#1041;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; ==<br>");
    html += F("&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1089; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084;<br>");
    html += F("&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1083;&#1083;&#1077;&#1082;&#1090;&#1072;<br><br>");
    html += F("URL: https://www.decima.ru/contacts/<br>");
    html += F("E-mail: decima@decima.ru</div><div class='hr'></div>");
    html += F("<div class='about' style='text-align:center'>Copyright (C) 2023-2026&nbsp;&nbsp;&nbsp; &#1054;&#1054;&#1054; &#1044;&#1077;&#1094;&#1080;&#1084;&#1072;</div>");
    html += F("</div></body></html>");
    return html;
}

